      ************************************
      * Authors: Bruno Bega Harnik       *
      *          Fernanda Pinheiro Reis  *
      * Date: 2020-03                    *
      * Purpose: Academics               *
      * Tectonics: cobc                  *
      ************************************
       IDENTIFICATION DIVISION.
           PROGRAM-ID. NOTASCAD.
           AUTHOR. Bruno Bega Harnik